Revit 2027 API
CompoundStructureLayer Constructor
 Creates a compound structure layer using default settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CompoundStructureLayer()
Public Sub New
public:
CompoundStructureLayer()
new : unit -> CompoundStructureLayer
Remarks
 Note that the combination of the default values does not create a completely valid CompoundStructureLayer. You should change the necessary values before adding to a CompoundStructure.
See Also
Reference
CompoundStructureLayer Class
CompoundStructureLayer Overload
Autodesk.Revit.DB Namespace